<a href="https://colab.research.google.com/github/ReynaraEzra/Machine-Learning-Time-Series/blob/main/Project_Time_Series_Using_Tensorflow.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Machine Learning Time Series Data Using Tensorflow**
## **Reynara Ezra Pratama**

In [1]:
import pandas as pd

In [2]:
path = '/content/city_temperature.csv'
df = pd.read_csv(path)

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [4]:
df_new = df[df['City'] == 'Jakarta']

In [5]:
df_new.head()

       Region    Country State     City  Month  Day  Year  AvgTemperature
349586   Asia  Indonesia   NaN  Jakarta      1    1  1995            85.0
349587   Asia  Indonesia   NaN  Jakarta      1    2  1995            82.3
349588   Asia  Indonesia   NaN  Jakarta      1    3  1995            81.7
349589   Asia  Indonesia   NaN  Jakarta      1    4  1995            83.1
349590   Asia  Indonesia   NaN  Jakarta      1    5  1995            80.6

In [13]:
date = df_new[['Year', 'Month', 'Day']]
date.head()

        Year  Month  Day
349586  1995      1    1
349587  1995      1    2
349588  1995      1    3
349589  1995      1    4
349590  1995      1    5

In [16]:
df_new['Date'] = pd.to_datetime(date)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [17]:
df_new

       Region    Country State     City  ...  Day  Year  AvgTemperature       Date
349586   Asia  Indonesia   NaN  Jakarta  ...    1  1995            85.0 1995-01-01
349587   Asia  Indonesia   NaN  Jakarta  ...    2  1995            82.3 1995-01-02
349588   Asia  Indonesia   NaN  Jakarta  ...    3  1995            81.7 1995-01-03
349589   Asia  Indonesia   NaN  Jakarta  ...    4  1995            83.1 1995-01-04
349590   Asia  Indonesia   NaN  Jakarta  ...    5  1995            80.6 1995-01-05
...       ...        ...   ...      ...  ...  ...   ...             ...        ...
358846   Asia  Indonesia   NaN  Jakarta  ...    8  2020            86.0 2020-05-08
358847   Asia  Indonesia   NaN  Jakarta  ...    9  2020            83.0 2020-05-09
358848   Asia  Indonesia   NaN  Jakarta  ...   10  2020            84.4 2020-05-10
358849   Asia  Indonesia   NaN  Jakarta  ...   11  2020            85.3 2020-05-11
358850   Asia  Indonesia   NaN  Jakarta  ...   12  2020            86.9 2020-05-12

[9265 rows x 9 columns]

In [18]:
df_new.set_index('Date')

           Region    Country State     City  Month  Day  Year  AvgTemperature
Date
1995-01-01   Asia  Indonesia   NaN  Jakarta      1    1  1995            85.0
1995-01-02   Asia  Indonesia   NaN  Jakarta      1    2  1995            82.3
1995-01-03   Asia  Indonesia   NaN  Jakarta      1    3  1995            81.7
1995-01-04   Asia  Indonesia   NaN  Jakarta      1    4  1995            83.1
1995-01-05   Asia  Indonesia   NaN  Jakarta      1    5  1995            80.6
...           ...        ...   ...      ...    ...  ...   ...             ...
2020-05-08   Asia  Indonesia   NaN  Jakarta      5    8  2020            86.0
2020-05-09   Asia  Indonesia   NaN  Jakarta      5    9  2020            83.0
2020-05-10   Asia  Indonesia   NaN  Jakarta      5   10  2020            84.4
2020-05-11   Asia  Indonesia   NaN  Jakarta      5   11  2020            85.3
2020-05-12   Asia  Indonesia   NaN  Jakarta      5   12  2020            86.9

[9265 rows x 8 columns]

In [19]:
df_new = df_new.loc[(df_new['Date'] >= '1995-01-01') & (df_new['Date'] < '2020-01-01'), ['Date', 'AvgTemperature']]

In [24]:
df_new = df_new.reset_index()

In [25]:
df_new = df_new.drop('index', axis=1)

In [26]:
df_new

           Date  AvgTemperature
0    1995-01-01            85.0
1    1995-01-02            82.3
2    1995-01-03            81.7
3    1995-01-04            83.1
4    1995-01-05            80.6
...         ...             ...
9127 2019-12-27            80.6
9128 2019-12-28            82.0
9129 2019-12-29            81.4
9130 2019-12-30            84.6
9131 2019-12-31            81.4

[9132 rows x 2 columns]